In [5]:
import pandas as pd
import numpy as np
data=pd.read_csv("titles.csv")
pd.set_option('max_rows',10,'max_columns',10)
print(data)

                         title  year
0               The Rising Son  1990
1      The Thousand Plane Raid  1969
2             Crucea de piatra  1993
3                      Country  2000
4                   Gaiking II  2011
...                        ...   ...
49995                    Rebel  1970
49996                  Suzanne  1996
49997                    Bomba  2013
49998     Aao Jao Ghar Tumhara  1984
49999               Mrs. Munck  1995

[50000 rows x 2 columns]

In [6]:
print(type(data)) #dataframe

<class 'pandas.core.frame.DataFrame'>

In [7]:
t=data['title']
print(type(t)) #series
print(t.head())

<class 'pandas.core.series.Series'>
0             The Rising Son
1    The Thousand Plane Raid
2           Crucea de piatra
3                    Country
4                 Gaiking II
Name: title, dtype: object

In [8]:
print(t.iloc[2]) #get value based

Crucea de piatra

In [9]:
#filtering
#year wise after 1995
t=data[data['year']>1995] #filter performed creates
#data frame
print(np.shape(t))
print(t.head())

(25120, 2)
                            title  year
3                         Country  2000
4                      Gaiking II  2011
5                     Medusa (IV)  2015
6  The Fresh Air Will Do You Good  2008
8                      L'outsider  2016

In [10]:
t=data[(data['year']>1900) & (data['year']<2000)]
#multiple conditions
print(t)

                           title  year
0                 The Rising Son  1990
1        The Thousand Plane Raid  1969
2               Crucea de piatra  1993
7             Alex in Wonderland  1970
12      Poka Makorer Ghar Bosoti  1996
...                          ...   ...
49994  Lille Fridolf blir morfar  1957
49995                      Rebel  1970
49996                    Suzanne  1996
49998       Aao Jao Ghar Tumhara  1984
49999                 Mrs. Munck  1995

[26884 rows x 2 columns]

In [11]:
#sorting 
movie_name=data[data['title']=='Macbeth'].sort_index()
print(movie_name) #shows default index wise sorting

         title  year
4226   Macbeth  1913
9322   Macbeth  2006
11722  Macbeth  2013
17166  Macbeth  1997
25847  Macbeth  1998

In [12]:
movie_name=data[data['title']=='Macbeth'].sort_values('year')
#sorting column wise
print(movie_name) #shows default index wise sorting

         title  year
4226   Macbeth  1913
17166  Macbeth  1997
25847  Macbeth  1998
9322   Macbeth  2006
11722  Macbeth  2013

In [23]:
#null values

data[['title','year']].isnull().head() #data['title','year'].notnull().head() is opposite #this is fpr column wise

   title   year
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [25]:
#row wise null
data[data['title'].notnull()].head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [26]:
data=pd.read_csv('cast.csv')
data.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [28]:
data[data['n'].isnull()]

,title,year,name,type,character,n
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NaN
7,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,NaN
...,...,...,...,...,...,...
74984,Ovum,2015,Christina Rosas Anastasiou,actress,Fertility Clinic Receptionist,NaN
74985,7 avlu,2009,Evmorfia Anastasiou,actress,Eleni,NaN
74993,I teliki apopliromi,2013,Mara Anastasopoulou,actress,Marina's friend,NaN
74997,The Magician King,2004,Tiannah Anastassiades,actress,Unicycle Race Attendant,NaN
74999,Toxic Tutu,2016,Zoe Anastassiou,actress,Demon of Toxicity,NaN

In [29]:
data[data['n'].isnull()].fillna('0/1') #fill value that are NaN

,title,year,name,type,character,n
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,0/1
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,0/1
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,0/1
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,0/1
7,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,0/1
...,...,...,...,...,...,...
74984,Ovum,2015,Christina Rosas Anastasiou,actress,Fertility Clinic Receptionist,0/1
74985,7 avlu,2009,Evmorfia Anastasiou,actress,Eleni,0/1
74993,I teliki apopliromi,2013,Mara Anastasopoulou,actress,Marina's friend,0/1
74997,The Magician King,2004,Tiannah Anastassiades,actress,Unicycle Race Attendant,0/1
74999,Toxic Tutu,2016,Zoe Anastassiou,actress,Demon of Toxicity,0/1

In [31]:
#STRING OPERATION
data=pd.read_csv("titles.csv")
data.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [34]:
data[data['title'].str.startswith('M')].head()

               title  year
5        Medusa (IV)  2015
18        Mahapurush  1965
19  Maa Durga Shakti  1999
38     Meigui xuanwo  2000
45       Mavi boncuk  1958

In [36]:
data['year'].value_counts() #counts no of occurances of particular year

2016    2363
2017    2138
2015    1849
2014    1701
2013    1609
        ...
1900       2
1906       1
2024       1
2023       1
1905       1
Name: year, Length: 119, dtype: int64

In [44]:
data['title'].str.startswith('Maa Du').value_counts() #get values of specific name of movie starting with Maa

False    49999
True         1
Name: title, dtype: int64